OpenFOAM-v1812/modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorCouette/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (79.89036   0 -4.18688)  // 0
    (96.36775   0 -5.05042)  // 1
    (96.36775 180 -5.05042)  // 2
    (79.89036 180 -4.18688)  // 3
    (79.89036   0  4.18688)  // 4
    (96.36775   0  5.05042)  // 5
    (96.36775 180  5.05042)  // 6
    (79.89036 180  4.18688)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (18 180 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    symmetry inlet
    (
        (1 5 4 0)
    )
    
    wall outlet
    (
        (3 7 6 2)
    )
    
    wall outerWall
    (
        (2 6 5 1)
    )
    
    wall innerWall
    (
        (0 4 7 3)
    )
    
    wedge wedge1
    (
        (0 1 2 3)
    )
    
    wedge wedge2
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
